# Parameters
nc: 7  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  # - [14, 11,  18, 17,  21, 24]  # P4/16
  # - [31, 20,  28, 30,  36, 35]  # P5/32
  # - [52, 33,  44, 46,  60, 54]
  - [42, 35,  53, 49,  70, 54]  # P4/16
  - [63, 67,  83, 69,  81, 88]  # P5/32
  - [109, 88, 108, 115, 153, 131]

# ResNet backbone
backbone:
  [[-1, 1, resnet181, [128]],  # 0
   [-1, 1, resnet182, [256]],  # 1
   [-1, 1, resnet183, [512]],  # 2
   [-1, 1, SPPF, [1024, 5]],  # 3
  ]


# head
head: [
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 7

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 11 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 14 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 3], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 17 (P5/32-large)

   [[11, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
